src/cf/DataProcessors/уатПодборПараметровРасшифровкиПлатежа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>уатПодборПараметровРасшифровкиПлатежа</Name>
			<Comment>Подбор параметров расшифровки платежа (уат)</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПлатежПоСуммеВзаиморасчетов</Name>
					<Comment>Определяет, будет ли пересчитываться сумма платежа при изменении суммы взаиморасчетов или наоборот</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодбиратьСумму</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоЗаявкам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособЗаполнения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДляПодбора</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РасшифровкаПлатежа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Выбран</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидВзаиморасчетов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВозникновения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДвиженияДокумента</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорКонтрагента</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КратностьВзаиморасчетов</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КурсВзаиморасчетов</Name>
							<Comment>(Общ) Курс валюты взаиморасчетов по договору или валюты взаиморасчетов с подотчетником</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сделка</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:DocumentRef.уатРеализацияУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.уатЗаказГрузоотправителя</v8:Type>
								<v8:Type>cfg:DocumentRef.уатСчетНаОплатуПокупателю</v8:Type>
								<v8:Type>cfg:DocumentRef.уатСчетНаОплатуПоставщика</v8:Type>
								<v8:Type>cfg:DocumentRef.уатРемонтныйЛист</v8:Type>
								<v8:Type>cfg:DocumentRef.уатПоступлениеТоваровУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПлатежа</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВзаиморасчетов</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДолга</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалютаПредставление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерВходящегоДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВходящегоДокумента</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗаказыНаТС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Выбран</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаказНаТС</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.уатЗаказГрузоотправителя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сделка</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:DocumentRef.уатРеализацияУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.уатЗаказГрузоотправителя</v8:Type>
								<v8:Type>cfg:DocumentRef.уатСчетНаОплатуПокупателю</v8:Type>
								<v8:Type>cfg:DocumentRef.уатСчетНаОплатуПоставщика</v8:Type>
								<v8:Type>cfg:DocumentRef.уатРемонтныйЛист</v8:Type>
								<v8:Type>cfg:DocumentRef.уатПоступлениеТоваровУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорКонтрагента</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПлатежа</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВзаиморасчетов</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидВзаиморасчетов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДолга</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/cf/AccumulationRegisters/уатВзаиморасчетыСКонтрагентами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>уатВзаиморасчетыСКонтрагентами</Name>
			<Comment>(уат)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаВзаиморасчетов</Name>
					<Comment>Сумма в валюте взаиморасчетов с НДС</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма в валюте управленческого учета с НДС</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сделка</Name>
					<Comment>Сделка</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.уатРеализацияУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.уатЗаказГрузоотправителя</v8:Type>
						<v8:Type>cfg:DocumentRef.уатСчетНаОплатуПокупателю</v8:Type>
						<v8:Type>cfg:DocumentRef.уатСчетНаОплатуПоставщика</v8:Type>
						<v8:Type>cfg:DocumentRef.уатРемонтныйЛист</v8:Type>
						<v8:Type>cfg:DocumentRef.уатПоступлениеТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/AccumulationRegisters/уатРасчетыПоДокументам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>уатРасчетыПоДокументам</Name>
			<Comment>Расчеты по документам (уат)</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаПриход</Name>
					<Comment>Сумма увеличения долга в валюте взаиморасчетов с НДС</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПриходУпр</Name>
					<Comment>Сумма увеличения долга в валюте управленческого учета с НДС</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРасход</Name>
					<Comment>Сумма уменьшения долга в валюте взаиморасчетов с НДС</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРасходУпр</Name>
					<Comment>Сумма уменьшения долга в валюте управленческого учета с НДС</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказНаТС</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уатЗаказГрузоотправителя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПолучательУслуг</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатПолучателиУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сделка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уатРеализацияУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.уатЗаказГрузоотправителя</v8:Type>
						<v8:Type>cfg:DocumentRef.уатСчетНаОплатуПокупателю</v8:Type>
						<v8:Type>cfg:DocumentRef.уатСчетНаОплатуПоставщика</v8:Type>
						<v8:Type>cfg:DocumentRef.уатРемонтныйЛист</v8:Type>
						<v8:Type>cfg:DocumentRef.уатПоступлениеТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтапОплаты</Name>
					<Comment>Этап по графику оплаты из договора</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатЭтапыОплаты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/Enums/ВедениеВзаиморасчетовПоДоговорам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВедениеВзаиморасчетовПоДоговорам</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоДоговоруВЦелом</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСчетам</Name>
					<Comment>По счетам</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоНакладным</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоЗаказамНаТС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоДокументуАрендаТС</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/DataProcessors/уатПодборПараметровРасшифровкиПлатежа/Ext/ManagerModule.bsl
#Область СлужебныеПроцедурыИФункции

Процедура СформироватьСписокДолгов(ОбработкаОбъект, СтруктураПараметров) Экспорт
	ДокументСсылка             = СтруктураПараметров.ДокументСсылка;
	Организация                = СтруктураПараметров.Организация;
	Контрагент                 = СтруктураПараметров.Контрагент;
	ТипЗадолженности           = СтруктураПараметров.ТипЗадолженности;
	ДатаДок                    = СтруктураПараметров.ДатаДок;
	ЕстьПодбор                 = СтруктураПараметров.ЕстьПодбор;
	ДокументРасшифровкаПлатежа = СтруктураПараметров.ДокументРасшифровкаПлатежа;
	
	Если ЗначениеЗаполнено(ДокументСсылка) Тогда
		ДопПараметрыКурса = ДокументСсылка;
	Иначе
		ДопПараметрыКурса = СтруктураПараметров.ДопПараметрыКурса;
	КонецЕсли;
		
	ТабРасшифровка = ОбработкаОбъект.РасшифровкаПлатежа.Выгрузить();
	ТабРасшифровка.Очистить();
	
	УстановитьПривилегированныйРежим(Истина);
	флЕС = Константы.уатКонфигурацияДляЕС.Получить();
	УстановитьПривилегированныйРежим(Ложь);
	
	// Из регистра "уатВзаиморасчетыСКонтрагентами" выбираем задолженности по договорам,
	// не ведущимся по расчетным документам
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатВзаиморасчетыСКонтрагентамиДвиженияДокумента.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	уатВзаиморасчетыСКонтрагентамиДвиженияДокумента.ДоговорКонтрагента.ВедениеВзаиморасчетов КАК ВедениеВзаиморасчетов,
	|	уатВзаиморасчетыСКонтрагентамиДвиженияДокумента.Валюта КАК ВалютаВзаиморасчетов,
	|	уатВзаиморасчетыСКонтрагентамиДвиженияДокумента.Сделка КАК Сделка,
	|	уатВзаиморасчетыСКонтрагентамиДвиженияДокумента.СуммаВзаиморасчетов * &ТипЗадолженностиМножитель КАК СуммаВзаиморасчетовОстаток
	|ПОМЕСТИТЬ ВзаиморасчетыОстаткиБезДвиженийДокумента
	|ИЗ
	|	РегистрНакопления.уатВзаиморасчетыСКонтрагентами КАК уатВзаиморасчетыСКонтрагентамиДвиженияДокумента
	|ГДЕ
	|	уатВзаиморасчетыСКонтрагентамиДвиженияДокумента.Регистратор = &Регистратор
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента,
	|	РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.ВедениеВзаиморасчетов,
	|	РасчетыСКонтрагентамиОстатки.Валюта,
	|	РасчетыСКонтрагентамиОстатки.Сделка,
	|	РасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток * &ТипЗадолженностиМножитель
	|ИЗ
	|	РегистрНакопления.уатВзаиморасчетыСКонтрагентами.Остатки(
	|			,
	|			Контрагент = &Контрагент
	|				И (&Организация = НЕОПРЕДЕЛЕНО
	|					ИЛИ Организация = &Организация)
	|				И ДоговорКонтрагента.ВидДоговора = &ВидДоговора
	|				И &ОтборыПоДоговорам) КАК РасчетыСКонтрагентамиОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВзаиморасчетыОстаткиБезДвиженийДокумента.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ВзаиморасчетыОстаткиБезДвиженийДокумента.ВедениеВзаиморасчетов КАК ВедениеВзаиморасчетов,
	|	ВзаиморасчетыОстаткиБезДвиженийДокумента.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	ВзаиморасчетыОстаткиБезДвиженийДокумента.Сделка КАК Сделка,
	|	СУММА(ВзаиморасчетыОстаткиБезДвиженийДокумента.СуммаВзаиморасчетовОстаток) КАК СуммаВзаиморасчетовОстаток
	|ПОМЕСТИТЬ ВзаиморасчетыОстатки
	|ИЗ
	|	ВзаиморасчетыОстаткиБезДвиженийДокумента КАК ВзаиморасчетыОстаткиБезДвиженийДокумента
	|
	|СГРУППИРОВАТЬ ПО
	|	ВзаиморасчетыОстаткиБезДвиженийДокумента.ДоговорКонтрагента,
	|	ВзаиморасчетыОстаткиБезДвиженийДокумента.ВедениеВзаиморасчетов,
	|	ВзаиморасчетыОстаткиБезДвиженийДокумента.ВалютаВзаиморасчетов,
	|	ВзаиморасчетыОстаткиБезДвиженийДокумента.Сделка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументРасшифровкаПлатежа.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ДокументРасшифровкаПлатежа.Сделка КАК Сделка,
	|	ДокументРасшифровкаПлатежа.ДатаВозникновения КАК ДатаВозникновения,
	|	ДокументРасшифровкаПлатежа.Валюта КАК ВалютаВзаиморасчетов,
	|	ДокументРасшифровкаПлатежа.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
	|	ДокументРасшифровкаПлатежа.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,
	|	ДокументРасшифровкаПлатежа.СуммаПлатежа КАК СуммаПлатежа,
	|	ДокументРасшифровкаПлатежа.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов
	|ПОМЕСТИТЬ втДокументРасшифровкаПлатежа
	|ИЗ
	|	&ДокументРасшифровкаПлатежа КАК ДокументРасшифровкаПлатежа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТекущиеЗадолженности.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ТекущиеЗадолженности.ВалютаВзаиморасчетов КАК Валюта,
	|	ТекущиеЗадолженности.Сделка КАК Сделка,
	|	ТекущиеЗадолженности.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
	|	ТекущиеЗадолженности.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,
	|	ТекущиеЗадолженности.Выбран КАК Выбран,
	|	ТекущиеЗадолженности.ДатаВозникновения КАК ДатаВозникновения,
	|	ТекущиеЗадолженности.СуммаПлатежа КАК СуммаПлатежа,
	|	ТекущиеЗадолженности.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
	|	ТекущиеЗадолженности.СуммаДолга КАК СуммаДолга
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЛОЖЬ КАК Выбран,
	|		РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|		РасчетыСКонтрагентамиОстатки.Сделка КАК Сделка,
	|		РасчетыСКонтрагентамиОстатки.Сделка.Дата КАК ДатаВозникновения,
	|		РасчетыСКонтрагентамиОстатки.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|		0 КАК КурсВзаиморасчетов,
	|		0 КАК КратностьВзаиморасчетов,
	|		0 КАК СуммаПлатежа,
	|		0 КАК СуммаВзаиморасчетов,
	|		РасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток КАК СуммаДолга
	|	ИЗ
	|		ВзаиморасчетыОстатки КАК РасчетыСКонтрагентамиОстатки
	|	ГДЕ
	|		РасчетыСКонтрагентамиОстатки.ВедениеВзаиморасчетов <> ЗНАЧЕНИЕ(Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом)
	|		И РасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток > 0
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ЛОЖЬ,
	|		РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента,
	|		РасчетыСКонтрагентамиОстатки.Сделка,
	|		ПоследнееДвижение.Период,
	|		РасчетыСКонтрагентамиОстатки.ВалютаВзаиморасчетов,
	|		0,
	|		0,
	|		0,
	|		0,
	|		РасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток
	|	ИЗ
	|		ВзаиморасчетыОстатки КАК РасчетыСКонтрагентамиОстатки
	|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|				МАКСИМУМ(РасчетыСКонтрагентами.Период) КАК Период,
	|				РасчетыСКонтрагентами.ДоговорКонтрагента КАК ДоговорКонтрагента
	|			ИЗ
	|				РегистрНакопления.уатВзаиморасчетыСКонтрагентами КАК РасчетыСКонтрагентами
	|			ГДЕ
	|				РасчетыСКонтрагентами.Активность = ИСТИНА
	|				И РасчетыСКонтрагентами.ВидДвижения = &ВидДвижения
	|			
	|			СГРУППИРОВАТЬ ПО
	|				РасчетыСКонтрагентами.ДоговорКонтрагента) КАК ПоследнееДвижение
	|			ПО РасчетыСКонтрагентамиОстатки.ДоговорКонтрагента = ПоследнееДвижение.ДоговорКонтрагента
	|	ГДЕ
	|		РасчетыСКонтрагентамиОстатки.ВедениеВзаиморасчетов = ЗНАЧЕНИЕ(Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом)
	|		И РасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток > 0
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ИСТИНА,
	|		втДокументРасшифровкаПлатежа.ДоговорКонтрагента,
	|		втДокументРасшифровкаПлатежа.Сделка,
	|		втДокументРасшифровкаПлатежа.ДатаВозникновения,
	|		втДокументРасшифровкаПлатежа.ВалютаВзаиморасчетов,
	|		втДокументРасшифровкаПлатежа.КурсВзаиморасчетов,
	|		втДокументРасшифровкаПлатежа.КратностьВзаиморасчетов,
	|		втДокументРасшифровкаПлатежа.СуммаПлатежа,
	|		втДокументРасшифровкаПлатежа.СуммаВзаиморасчетов,
	|		0
	|	ИЗ
	|		втДокументРасшифровкаПлатежа КАК втДокументРасшифровкаПлатежа) КАК ТекущиеЗадолженности");

	Если ОбработкаОбъект.СпособЗаполнения = "ФИФО" Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ДатаВозникновения Убыв", "ДатаВозникновения Возр");
	КонецЕсли;
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "уатПлатежноеПоручениеВходящее", ДокументСсылка.Метаданные().Имя);
	
	Если СтруктураПараметров.Свойство("ОтборыПоДоговорам") И СтруктураПараметров.ОтборыПоДоговорам.Количество() > 0 Тогда
		ИндексОтбора = 1;
		Для Каждого ТекОтбор Из СтруктураПараметров.ДопОтборы Цикл 
			ТекИмяПараметра  = "Значение" + Формат(ИндексОтбора, "ЧГ=");
			ДопСтрокаОтборов = ДопСтрокаОтборов + " И " + ПолучитьСтрокуОтбораПоДоговорам(ТекОтбор.ВидСравнения, "&" + ТекИмяПараметра, Строка(ТекОтбор.ЛевоеЗначение));
			
			Запрос.УстановитьПараметр(ТекИмяПараметра, ТекОтбор.ПравоеЗначение);
			
			ИндексОтбора = ИндексОтбора + 1;
		КонецЦикла;
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборыПоДоговорам", ДопСтрокаОтборов);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Организация"        , ?(ЗначениеЗаполнено(Организация), Организация, Неопределено));
	Запрос.УстановитьПараметр("Контрагент"         , Контрагент);
	Запрос.УстановитьПараметр("ВидДвижения"        , ?(ТипЗадолженности="<0", ВидДвиженияНакопления.Расход, ВидДвиженияНакопления.Приход));
	Запрос.УстановитьПараметр("ТипЗадолженностиМножитель", ?(ТипЗадолженности="<0", -1, 1) * ?(СтруктураПараметров.ВидОперацииВозврат, -1, 1));
	Запрос.УстановитьПараметр("ДатаПлатежа"        , ДатаДок);
	Запрос.УстановитьПараметр("Регистратор"        , ?(ДокументСсылка = Неопределено, Неопределено, ДокументСсылка.Ссылка));
	Если ТипЗадолженности = "<0" Тогда
		мВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком;
	Иначе
		мВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем;
	КонецЕсли;
	//Если ТипЗнч(ДокументСсылка.Ссылка) = Тип("ДокументСсылка.уатПлатежноеПоручениеВходящее")
	// Или ТипЗнч(ДокументСсылка.Ссылка) = Тип("ДокументСсылка.уатПриходныйКассовыйОрдер") Тогда 
	//	мВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем;
	//Иначе
	//	мВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком;
	//КонецЕсли;
	Запрос.УстановитьПараметр("ВидДоговора"        , мВидДоговора);
	Запрос.УстановитьПараметр("флЕС"               , флЕС);
	Запрос.УстановитьПараметр("ОтборыПоДоговорам"  , Истина);
	
	//ДокументРасшифровкаПлатежа.Колонки.Добавить("ДатаВозникновения");
	ДокументРасшифровкаПлатежа.Колонки.Добавить("ВалютаВзаиморасчетов");
	Для Каждого ТекСтрока Из ДокументРасшифровкаПлатежа Цикл
		Если ТекСтрока.Сделка = Неопределено Тогда
			ТекСтрока.ДатаВозникновения = ДатаДок;
		Иначе
			ТекСтрока.ДатаВозникновения = ТекСтрока.Сделка.Дата;
		КонецЕсли;
		Если ТекСтрока.Валюта.Пустая() Тогда
			ТекСтрока.Валюта = ТекСтрока.ДоговорКонтрагента.ВалютаВзаиморасчетов;
		КонецЕсли;
	КонецЦикла;
	Запрос.УстановитьПараметр("ДокументРасшифровкаПлатежа", ДокументРасшифровкаПлатежа);
	
	//Если ДокументСсылка.Метаданные().Имя = "уатЗаявкаНаРасходованиеДС" Тогда
	//	Запрос.Текст = СтрЗаменить(Запрос.Текст, 
	//		"ВЫБОР
	//		|			КОГДА ТЧДокументаПлатежа.ВалютаВзаиморасчетов = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	//		|				ТОГДА ТЧДокументаПлатежа.ДоговорКонтрагента.ВалютаВзаиморасчетов
	//		|			ИНАЧЕ ТЧДокументаПлатежа.ВалютаВзаиморасчетов
	//		|		КОНЕЦ",
	//		"ТЧДокументаПлатежа.ДоговорКонтрагента.ВалютаВзаиморасчетов");
	//КонецЕсли;
	
	ТабРезультат = Запрос.Выполнить().Выгрузить();
	
	// Заполнение колонок КурсВзаиморасчетов и КратностьВзаиморасчетов по строкам задолженности
	// с учетом настроек взаиморасчетов и многостранового учета. 
	Для Каждого ТекСтрока Из ТабРезультат Цикл
		Если ТекСтрока.КурсВзаиморасчетов = 0 Тогда
			ДатаКурса = уатОбщегоНазначенияТиповые.ПолучитьДатуКурсаРасшифровкиПлатежа(
				ДатаДок, ТекСтрока.ДоговорКонтрагента, ТекСтрока.Сделка);
			КурсКратностьВзаим = уатОбщегоНазначенияТиповые.ПолучитьКурсВалюты(
				ТекСтрока.Валюта, ДатаКурса, ДопПараметрыКурса);
			ТекСтрока.КурсВзаиморасчетов      = КурсКратностьВзаим.Курс;
			ТекСтрока.КратностьВзаиморасчетов = КурсКратностьВзаим.Кратность;
		КонецЕсли;
	КонецЦикла;
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ТекущиеЗадолженности.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ТекущиеЗадолженности.Валюта КАК Валюта,
	|	ТекущиеЗадолженности.Сделка КАК Сделка,
	|	ТекущиеЗадолженности.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
	|	ТекущиеЗадолженности.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,
	|	ТекущиеЗадолженности.Выбран КАК Выбран,
	|	ТекущиеЗадолженности.ДатаВозникновения КАК ДатаВозникновения,
	|	ТекущиеЗадолженности.СуммаПлатежа КАК СуммаПлатежа,
	|	ТекущиеЗадолженности.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
	|	ТекущиеЗадолженности.СуммаДолга КАК СуммаДолга
	|ПОМЕСТИТЬ втТекущиеЗадолженности
	|ИЗ
	|	&ТекущиеЗадолженности КАК ТекущиеЗадолженности
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТекущиеЗадолженности.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ТекущиеЗадолженности.Валюта КАК Валюта,
	|	ТекущиеЗадолженности.Сделка КАК Сделка,
	|	ТекущиеЗадолженности.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
	|	ТекущиеЗадолженности.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,
	|	МАКСИМУМ(ТекущиеЗадолженности.Выбран) КАК Выбран,
	|	МИНИМУМ(ТекущиеЗадолженности.ДатаВозникновения) КАК ДатаВозникновения,
	|	СУММА(ТекущиеЗадолженности.СуммаПлатежа) КАК СуммаПлатежа,
	|	СУММА(ТекущиеЗадолженности.СуммаВзаиморасчетов) КАК СуммаВзаиморасчетов,
	|	СУММА(ТекущиеЗадолженности.СуммаДолга) КАК СуммаДолга
	|ИЗ
	|	втТекущиеЗадолженности КАК ТекущиеЗадолженности
	|
	|СГРУППИРОВАТЬ ПО
	|	ТекущиеЗадолженности.ДоговорКонтрагента,
	|	ТекущиеЗадолженности.Валюта,
	|	ТекущиеЗадолженности.Сделка,
	|	ТекущиеЗадолженности.КурсВзаиморасчетов,
	|	ТекущиеЗадолженности.КратностьВзаиморасчетов
	|
	|УПОРЯДОЧИТЬ ПО
	|	Выбран УБЫВ,
	|	ДатаВозникновения УБЫВ,
	|	Сделка");
	Запрос.УстановитьПараметр("ТекущиеЗадолженности", ТабРезультат);
	ТабРезультат = Запрос.Выполнить().Выгрузить();
	
	// заполнение некоторых колонок результирующей таблицы долгов
	ТабРезультат.Колонки.Добавить("НомерВходящегоДокумента");
	ТабРезультат.Колонки.Добавить("ДатаВходящегоДокумента");
	ТабРезультат.Колонки.Добавить("ВалютаПредставление");
		
	Для Каждого ТекСтрока Из ТабРезультат Цикл
		// заполнение представления валюты
		Если ТекСтрока.КратностьВзаиморасчетов = 0 Тогда
			ПредставлениеКурса = Формат(ТекСтрока.КурсВзаиморасчетов, "ЧДЦ=4; ЧН=0,0000");
		ИначеЕсли ТекСтрока.КурсВзаиморасчетов = 1 И ТекСтрока.КратностьВзаиморасчетов = 1 Тогда
			ПредставлениеКурса = "";
		Иначе
			ПредставлениеКурса = Формат(ТекСтрока.КурсВзаиморасчетов / ТекСтрока.КратностьВзаиморасчетов, "ЧДЦ=4; ЧН=0,0000");
		КонецЕсли;
		ТекСтрока.ВалютаПредставление = "" + ТекСтрока.Валюта + ?(ПустаяСтрока(ПредставлениеКурса), "", " (" + ПредставлениеКурса + ")");
		
		// заполнение номера и даты входящего документа
		Если ТипЗнч(ТекСтрока.Сделка) = Тип("ДокументСсылка.уатРеализацияУслуг")
			ИЛИ ТипЗнч(ТекСтрока.Сделка) = Тип("ДокументСсылка.уатСчетНаОплатуПокупателю") Тогда
			ТекСтрока.НомерВходящегоДокумента = ТекСтрока.Сделка.НомерПлатежноРасчетногоДокумента;
			ТекСтрока.ДатаВходящегоДокумента  = ТекСтрока.Сделка.ДатаПлатежноРасчетногоДокумента;
		ИначеЕсли ТипЗнч(ТекСтрока.Сделка) = Тип("ДокументСсылка.уатЗаказГрузоотправителя") Тогда
			ТекСтрока.НомерВходящегоДокумента = ТекСтрока.Сделка.НомерПоУчетуЗаказчика;
			ТекСтрока.ДатаВходящегоДокумента  = ТекСтрока.Сделка.ДатаВходящегоДокумента;
		ИначеЕсли ТипЗнч(ТекСтрока.Сделка) = Тип("ДокументСсылка.уатПоступлениеТоваровУслуг")
			ИЛИ ТипЗнч(ТекСтрока.Сделка) = Тип("ДокументСсылка.уатСчетНаОплатуПоставщика") Тогда
			ТекСтрока.НомерВходящегоДокумента = ТекСтрока.Сделка.НомерВходящегоДокумента;
			ТекСтрока.ДатаВходящегоДокумента  = ТекСтрока.Сделка.ДатаВходящегоДокумента;
		КонецЕсли;
	КонецЦикла;
	
	уатОбщегоНазначенияТиповые.ЗагрузитьВТаблицуЗначений(ТабРезультат, ТабРасшифровка);
	
	ОбработкаОбъект.РасшифровкаПлатежа.Загрузить(ТабРасшифровка);
	
	ЗаполнитьЗадолженностьПоЗаказам(ОбработкаОбъект, СтруктураПараметров);
КонецПроцедуры

// Функция возвращает Строку Вида отбора для запроса
// 
// Параметры
// ВыбВидСравнения       - ВидСравнения
// ЗначениеОтбора        - Значение отбора запроса
// СтрокаПоляОтбора      - Строка, Аргумент запроса, т.е. то что должно быть написано до вида сравнения
// ЗначениеОтбораС       - Произвольный, значение отбора для видов сравнения, у которых необходимо 
//							указывать два значения, начальное значение
// ЗначениеОтбораПо      - Произвольный, значение отбора для видов сравнения, у которых необходимо
//							указывать два значения, конечное значение
// СамоЗначение          - Значение отбора запроса
// СамоЗначениеС         - Произвольный, значение отбора для видов сравнения, у которых необходимо 
//							указывать два значения, начальное значение
// СамоЗначениеПо        - Произвольный, значение отбора для видов сравнения, у которых необходимо
//							указывать два значения, начальное значение
//
// Возвращаемое значение 
//  Строка для запроса
//
Функция ПолучитьСтрокуОтбораПоДоговорам(ВыбВидСравнения, ЗначениеОтбора, СтрокаПоляОтбора, ЗначениеОтбораС = Неопределено, 
		ЗначениеОтбораПо = Неопределено, СамоЗначение = Неопределено, СамоЗначениеС = Неопределено, 
		СамоЗначениеПо = Неопределено)
	
	СтрокаВозврата = "";
	Если ВыбВидСравнения = ВидСравненияКомпоновкиДанных.Равно Тогда
		СтрокаВозврата = СтрокаПоляОтбора + Строка(" = " + ЗначениеОтбора);
	ИначеЕсли ВыбВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно Тогда
		СтрокаВозврата = СтрокаПоляОтбора + Строка(" <> " + ЗначениеОтбора);
	ИначеЕсли ВыбВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке Тогда
		СтрокаВозврата = СтрокаПоляОтбора + Строка(" В (" + ЗначениеОтбора+")");
	ИначеЕсли ВыбВидСравнения = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии 
		ИЛИ ВыбВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии Тогда
			СтрокаВозврата = СтрокаПоляОтбора + Строка(" В ИЕРАРХИИ(" + ЗначениеОтбора+")");
	ИначеЕсли ВыбВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке Тогда
		СтрокаВозврата = СтрокаПоляОтбора + Строка(" НЕ В (" + ЗначениеОтбора+")");
	ИначеЕсли ВыбВидСравнения = ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии 
		ИЛИ ВыбВидСравнения = ВидСравненияКомпоновкиДанных.НеВИерархии Тогда
			СтрокаВозврата = СтрокаПоляОтбора + Строка(" НЕ В ИЕРАРХИИ(" + ЗначениеОтбора+")");
	ИначеЕсли ВыбВидСравнения = ВидСравненияКомпоновкиДанных.Больше Тогда
		СтрокаВозврата = СтрокаПоляОтбора + Строка(" > " + ЗначениеОтбора);
	ИначеЕсли ВыбВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно Тогда
		СтрокаВозврата = СтрокаПоляОтбора + Строка(" >= " + ЗначениеОтбора);
	ИначеЕсли ВыбВидСравнения = ВидСравненияКомпоновкиДанных.Меньше Тогда
		Если НЕ (ТипЗнч(СамоЗначение) = Тип("Дата") И НЕ ЗначениеЗаполнено(СамоЗначение)) Тогда
			СтрокаВозврата = СтрокаПоляОтбора + Строка(" < " + ЗначениеОтбора);
		КонецЕсли; 
	ИначеЕсли ВыбВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно Тогда
		Если НЕ (ТипЗнч(СамоЗначение) = Тип("Дата") И НЕ ЗначениеЗаполнено(СамоЗначение)) Тогда
			СтрокаВозврата = СтрокаПоляОтбора + Строка(" <= " + ЗначениеОтбора);
		КонецЕсли; 
	КонецЕсли;
	
	Возврат СтрокаВозврата;
	
КонецФункции // ПолучитьСтрокуОтбораПоДоговорам()

Процедура ЗаполнитьЗадолженностьПоЗаказам(ОбработкаОбъект, СтруктураПараметров)
	
	Если НЕ уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(СтруктураПараметров.Организация,
		ПланыВидовХарактеристик.уатПраваИНастройки.РазнесениеПлатежейПоЗаказам) Тогда
		Возврат;
	КонецЕсли;
			
	тблРасшифровкаПлатежа = ОбработкаОбъект.РасшифровкаПлатежа.Выгрузить().Скопировать();
	мсвСделки = тблРасшифровкаПлатежа.ВыгрузитьКолонку("Сделка");
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ДокументЗаказы.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ДокументЗаказы.Сделка КАК Сделка,
	|	ДокументЗаказы.ЗаказНаТС КАК ЗаказНаТС,
	|	ДокументЗаказы.Валюта КАК Валюта,
	|	ДокументЗаказы.СуммаПлатежа КАК СуммаПлатежа,
	|	ДокументЗаказы.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов
	|ПОМЕСТИТЬ втДокументЗаказы
	|ИЗ
	|	&ДокументЗаказы КАК ДокументЗаказы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	уатРасчетыПоДокументамОбороты.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	уатРасчетыПоДокументамОбороты.Сделка КАК Сделка,
	|	уатРасчетыПоДокументамОбороты.ЗаказНаТС КАК ЗаказНаТС,
	|	уатРасчетыПоДокументамОбороты.Валюта КАК Валюта,
	|	СУММА(уатРасчетыПоДокументамОбороты.СуммаПриходОборот - уатРасчетыПоДокументамОбороты.СуммаРасходОборот) КАК СуммаВзаиморасчетов
	|ПОМЕСТИТЬ втРасчетыПоЗаказамНаТС
	|ИЗ
	|	РегистрНакопления.уатРасчетыПоДокументам.Обороты(
	|			,
	|			,
	|			Регистратор,
	|			Сделка В (&мсвСделки)
	|				И (ДоговорКонтрагента.ВедениеВзаиморасчетов = ЗНАЧЕНИЕ(Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам)
	|					ИЛИ ДоговорКонтрагента.ВедениеВзаиморасчетов = ЗНАЧЕНИЕ(Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоНакладным))
	|				И ЗаказНаТС <> ЗНАЧЕНИЕ(Документ.уатЗаказГрузоотправителя.ПустаяСсылка)) КАК уатРасчетыПоДокументамОбороты
	|ГДЕ
	|	уатРасчетыПоДокументамОбороты.Регистратор <> &Регистратор
	|
	|СГРУППИРОВАТЬ ПО
	|	уатРасчетыПоДокументамОбороты.ДоговорКонтрагента,
	|	уатРасчетыПоДокументамОбороты.Сделка,
	|	уатРасчетыПоДокументамОбороты.ЗаказНаТС,
	|	уатРасчетыПоДокументамОбороты.Валюта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЛОЖЬ КАК Выбран,
	|	уатРасчетыПоДокументамОбороты.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	уатРасчетыПоДокументамОбороты.Сделка КАК Сделка,
	|	уатРасчетыПоДокументамОбороты.ЗаказНаТС КАК ЗаказНаТС,
	|	уатРасчетыПоДокументамОбороты.Валюта КАК Валюта,
	|	0 КАК СуммаПлатежа,
	|	0 КАК СуммаВзаиморасчетов,
	|	уатРасчетыПоДокументамОбороты.СуммаВзаиморасчетов КАК СуммаДолга
	|ПОМЕСТИТЬ втРасчетыПоЗаказамСвернутая
	|ИЗ
	|	втРасчетыПоЗаказамНаТС КАК уатРасчетыПоДокументамОбороты
	|ГДЕ
	|	уатРасчетыПоДокументамОбороты.СуммаВзаиморасчетов > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИСТИНА,
	|	втДокументЗаказы.ДоговорКонтрагента,
	|	втДокументЗаказы.Сделка,
	|	втДокументЗаказы.ЗаказНаТС,
	|	втДокументЗаказы.Валюта,
	|	втДокументЗаказы.СуммаПлатежа,
	|	втДокументЗаказы.СуммаВзаиморасчетов,
	|	0
	|ИЗ
	|	втДокументЗаказы КАК втДокументЗаказы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(втРасчетыПоЗаказамСвернутая.Выбран) КАК Выбран,
	|	втРасчетыПоЗаказамСвернутая.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	втРасчетыПоЗаказамСвернутая.Сделка КАК Сделка,
	|	втРасчетыПоЗаказамСвернутая.ЗаказНаТС КАК ЗаказНаТС,
	|	втРасчетыПоЗаказамСвернутая.Валюта КАК Валюта,
	|	СУММА(втРасчетыПоЗаказамСвернутая.СуммаПлатежа) КАК СуммаПлатежа,
	|	СУММА(втРасчетыПоЗаказамСвернутая.СуммаВзаиморасчетов) КАК СуммаВзаиморасчетов,
	|	СУММА(втРасчетыПоЗаказамСвернутая.СуммаДолга) КАК СуммаДолга
	|ИЗ
	|	втРасчетыПоЗаказамСвернутая КАК втРасчетыПоЗаказамСвернутая
	|
	|СГРУППИРОВАТЬ ПО
	|	втРасчетыПоЗаказамСвернутая.ДоговорКонтрагента,
	|	втРасчетыПоЗаказамСвернутая.Сделка,
	|	втРасчетыПоЗаказамСвернутая.ЗаказНаТС,
	|	втРасчетыПоЗаказамСвернутая.Валюта");
	Запрос.УстановитьПараметр("мсвСделки",   мсвСделки);
	Запрос.УстановитьПараметр("Регистратор", ?(СтруктураПараметров.ДокументСсылка = Неопределено, Неопределено, СтруктураПараметров.ДокументСсылка));
	
	ДокументЗаказы = СтруктураПараметров.ДокументЗаказы;
	Для Каждого ТекСтрока Из ДокументЗаказы Цикл
		Если ТекСтрока.Валюта.Пустая() Тогда
			ТекСтрока.Валюта = ТекСтрока.ДоговорКонтрагента.ВалютаВзаиморасчетов;
		КонецЕсли;
	КонецЦикла;
	Запрос.УстановитьПараметр("ДокументЗаказы", ДокументЗаказы);
	
	тблЗадолженностьПоЗаказам = Запрос.Выполнить().Выгрузить();
	
	ОбработкаОбъект.ЗаказыНаТС.Загрузить(тблЗадолженностьПоЗаказам);
КонецПроцедуры

#КонецОбласти
